{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      },
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      },
      {
        "type": "Split",
        "pattern": {
          "String": "(\\\\[a-zA-Z]+|\\\\[^a-zA-Z]|[\\{\\}\\(\\)\\[\\]])"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|endoftext|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|endoftext|>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|endoftext|>": {
        "id": "<|endoftext|>",
        "ids": [
          0
        ],
        "tokens": [
          "<|endoftext|>"
        ]
      },
      "<|pad|>": {
        "id": "<|pad|>",
        "ids": [
          1
        ],
        "tokens": [
          "<|pad|>"
        ]
      },
      "<|unk|>": {
        "id": "<|unk|>",
        "ids": [
          2
        ],
        "tokens": [
          "<|unk|>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|pad|>": 1,
      "<|unk|>": 2,
      "(": 3,
      ")": 4,
      "+": 5,
      ",": 6,
      "-": 7,
      ".": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "4": 12,
      "6": 13,
      "=": 14,
      ">": 15,
      "A": 16,
      "B": 17,
      "C": 18,
      "D": 19,
      "E": 20,
      "F": 21,
      "G": 22,
      "I": 23,
      "L": 24,
      "N": 25,
      "O": 26,
      "P": 27,
      "Q": 28,
      "R": 29,
      "S": 30,
      "T": 31,
      "U": 32,
      "X": 33,
      "Z": 34,
      "\\": 35,
      "^": 36,
      "_": 37,
      "a": 38,
      "b": 39,
      "c": 40,
      "d": 41,
      "e": 42,
      "f": 43,
      "g": 44,
      "h": 45,
      "i": 46,
      "k": 47,
      "l": 48,
      "m": 49,
      "n": 50,
      "o": 51,
      "p": 52,
      "q": 53,
      "r": 54,
      "s": 55,
      "t": 56,
      "u": 57,
      "v": 58,
      "w": 59,
      "x": 60,
      "y": 61,
      "z": 62,
      "{": 63,
      "|": 64,
      "}": 65,
      "in": 66,
      "be": 67,
      "ma": 68,
      "th": 69,
      "nd": 70,
      "re": 71,
      "ta": 72,
      "al": 73,
      "eq": 74,
      "end": 75,
      "gin": 76,
      "si": 77,
      "begin": 78,
      "ro": 79,
      "on": 80,
      "the": 81,
      "se": 82,
      "su": 83,
      "at": 84,
      "ra": 85,
      "ri": 86,
      "ar": 87,
      "are": 88,
      "er": 89,
      "is": 90,
      "me": 91,
      "psi": 92,
      "pro": 93,
      "am": 94,
      "bb": 95,
      "ca": 96,
      "el": 97,
      "ex": 98,
      "ll": 99,
      "lon": 100,
      "nu": 101,
      "or": 102,
      "sq": 103,
      "to": 104,
      "ts": 105,
      "tri": 106,
      "math": 107,
      "matri": 108,
      "equ": 109,
      "rac": 110,
      "psilon": 111,
      "mathbb": 112,
      "matrix": 113,
      "em": 114,
      "eta": 115,
      "hi": 116,
      "ig": 117,
      "mbe": 118,
      "of": 119,
      "ore": 120,
      "uare": 121,
      "ine": 122,
      "int": 123,
      "that": 124,
      "all": 125,
      "there": 126,
      "set": 127,
      "suc": 128,
      "ists": 129,
      "elta": 130,
      "exists": 131,
      "numbe": 132,
      "square": 133,
      "number": 134,
      "Le": 135,
      "Th": 136,
      "ap": 137,
      "and": 138,
      "bd": 139,
      "bl": 140,
      "brac": 141,
      "bmatrix": 142,
      "co": 143,
      "cu": 144,
      "ceq": 145,
      "delta": 146,
      "epsilon": 147,
      "for": 148,
      "frac": 149,
      "ga": 150,
      "im": 151,
      "ion": 152,
      "lem": 153,
      "line": 154,
      "ov": 155,
      "pre": 156,
      "pri": 157,
      "ral": 158,
      "ty": 159,
      "und": 160,
      "inf": 161,
      "alig": 162,
      "sim": 163,
      "roll": 164,
      "theore": 165,
      "ses": 166,
      "sum": 167,
      "ation": 168,
      "ray": 169,
      "ary": 170,
      "array": 171,
      "erbrac": 172,
      "erline": 173,
      "mega": 174,
      "proof": 175,
      "amma": 176,
      "ambd": 177,
      "cases": 178,
      "equation": 179,
      "numbers": 180,
      "Let": 181,
      "bla": 182,
      "coroll": 183,
      "cup": 184,
      "lemma": 185,
      "prime": 186,
      "align": 187,
      "theorem": 188,
      "erbrace": 189,
      "ambda": 190,
      "corollary": 191
    },
    "merges": [
      [
        "i",
        "n"
      ],
      [
        "b",
        "e"
      ],
      [
        "m",
        "a"
      ],
      [
        "t",
        "h"
      ],
      [
        "n",
        "d"
      ],
      [
        "r",
        "e"
      ],
      [
        "t",
        "a"
      ],
      [
        "a",
        "l"
      ],
      [
        "e",
        "q"
      ],
      [
        "e",
        "nd"
      ],
      [
        "g",
        "in"
      ],
      [
        "s",
        "i"
      ],
      [
        "be",
        "gin"
      ],
      [
        "r",
        "o"
      ],
      [
        "o",
        "n"
      ],
      [
        "th",
        "e"
      ],
      [
        "s",
        "e"
      ],
      [
        "s",
        "u"
      ],
      [
        "a",
        "t"
      ],
      [
        "r",
        "a"
      ],
      [
        "r",
        "i"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "re"
      ],
      [
        "e",
        "r"
      ],
      [
        "i",
        "s"
      ],
      [
        "m",
        "e"
      ],
      [
        "p",
        "si"
      ],
      [
        "p",
        "ro"
      ],
      [
        "a",
        "m"
      ],
      [
        "b",
        "b"
      ],
      [
        "c",
        "a"
      ],
      [
        "e",
        "l"
      ],
      [
        "e",
        "x"
      ],
      [
        "l",
        "l"
      ],
      [
        "l",
        "on"
      ],
      [
        "n",
        "u"
      ],
      [
        "o",
        "r"
      ],
      [
        "s",
        "q"
      ],
      [
        "t",
        "o"
      ],
      [
        "t",
        "s"
      ],
      [
        "t",
        "ri"
      ],
      [
        "ma",
        "th"
      ],
      [
        "ma",
        "tri"
      ],
      [
        "eq",
        "u"
      ],
      [
        "ra",
        "c"
      ],
      [
        "psi",
        "lon"
      ],
      [
        "math",
        "bb"
      ],
      [
        "matri",
        "x"
      ],
      [
        "e",
        "m"
      ],
      [
        "e",
        "ta"
      ],
      [
        "h",
        "i"
      ],
      [
        "i",
        "g"
      ],
      [
        "m",
        "be"
      ],
      [
        "o",
        "f"
      ],
      [
        "o",
        "re"
      ],
      [
        "u",
        "are"
      ],
      [
        "in",
        "e"
      ],
      [
        "in",
        "t"
      ],
      [
        "th",
        "at"
      ],
      [
        "al",
        "l"
      ],
      [
        "the",
        "re"
      ],
      [
        "se",
        "t"
      ],
      [
        "su",
        "c"
      ],
      [
        "is",
        "ts"
      ],
      [
        "el",
        "ta"
      ],
      [
        "ex",
        "ists"
      ],
      [
        "nu",
        "mbe"
      ],
      [
        "sq",
        "uare"
      ],
      [
        "numbe",
        "r"
      ],
      [
        "L",
        "e"
      ],
      [
        "T",
        "h"
      ],
      [
        "a",
        "p"
      ],
      [
        "a",
        "nd"
      ],
      [
        "b",
        "d"
      ],
      [
        "b",
        "l"
      ],
      [
        "b",
        "rac"
      ],
      [
        "b",
        "matrix"
      ],
      [
        "c",
        "o"
      ],
      [
        "c",
        "u"
      ],
      [
        "c",
        "eq"
      ],
      [
        "d",
        "elta"
      ],
      [
        "e",
        "psilon"
      ],
      [
        "f",
        "or"
      ],
      [
        "f",
        "rac"
      ],
      [
        "g",
        "a"
      ],
      [
        "i",
        "m"
      ],
      [
        "i",
        "on"
      ],
      [
        "l",
        "em"
      ],
      [
        "l",
        "ine"
      ],
      [
        "o",
        "v"
      ],
      [
        "p",
        "re"
      ],
      [
        "p",
        "ri"
      ],
      [
        "r",
        "al"
      ],
      [
        "t",
        "y"
      ],
      [
        "u",
        "nd"
      ],
      [
        "in",
        "f"
      ],
      [
        "al",
        "ig"
      ],
      [
        "si",
        "m"
      ],
      [
        "ro",
        "ll"
      ],
      [
        "the",
        "ore"
      ],
      [
        "se",
        "s"
      ],
      [
        "su",
        "m"
      ],
      [
        "at",
        "ion"
      ],
      [
        "ra",
        "y"
      ],
      [
        "ar",
        "y"
      ],
      [
        "ar",
        "ray"
      ],
      [
        "er",
        "brac"
      ],
      [
        "er",
        "line"
      ],
      [
        "me",
        "ga"
      ],
      [
        "pro",
        "of"
      ],
      [
        "am",
        "ma"
      ],
      [
        "am",
        "bd"
      ],
      [
        "ca",
        "ses"
      ],
      [
        "equ",
        "ation"
      ],
      [
        "number",
        "s"
      ],
      [
        "Le",
        "t"
      ],
      [
        "bl",
        "a"
      ],
      [
        "co",
        "roll"
      ],
      [
        "cu",
        "p"
      ],
      [
        "lem",
        "ma"
      ],
      [
        "pri",
        "me"
      ],
      [
        "alig",
        "n"
      ],
      [
        "theore",
        "m"
      ],
      [
        "erbrac",
        "e"
      ],
      [
        "ambd",
        "a"
      ],
      [
        "coroll",
        "ary"
      ]
    ]
  }
}